Revit 2027 API
FaceEdgeNode Class
 An output node that represents a Face edge.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.FaceDetailNode
 Autodesk.Revit.DB.FaceEdgeNode
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FaceEdgeNode : FaceDetailNode
Public Class FaceEdgeNode
	Inherits FaceDetailNode
public ref class FaceEdgeNode : public FaceDetailNode
type FaceEdgeNode =
    class
        inherit FaceDetailNode
    end
The FaceEdgeNode type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RenderNode)
LineProperties |  Access to the line (pen) properties of the curve being drawn.
(Inherited from FaceDetailNode)
NodeName |  A readable name of the output node.
(Inherited from RenderNode)
Top
Methods
Name | Description
Dispose
(Inherited from RenderNode)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFaceEdge |  Returns the Face edge object corresponding to the node.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetInstanceTransform |  Returns instance transform of the object being drawn.
(Inherited from FaceDetailNode)
GetLinkTransform |  Returns link transform of the object being drawn.
(Inherited from FaceDetailNode)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 See also: OnFaceEdge2D(FaceEdgeNode).
See Also
Reference
Autodesk.Revit.DB Namespace